<a href="https://colab.research.google.com/github/Void-Brain70/Pandas/blob/main/Different_Ways_Of_Creating_Dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
# 1st way of creating a dataframe
# Read csv file
import pandas as pd
df = pd.read_csv("/content/weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [3]:
# 2nd way of creating a dataframe
# Read excel file
df = pd.read_excel("/content/weather_data.xlsx")
df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow

In [5]:
# 3rd way of creating a dataframe
info = {
    'Name':['Anik Chandra','Abdul Rab Anik','Anisul islam'],
    'ID':['18101070','18101073','18101079'],
    'Cgpa':['3.67','3.48','3.46']
}
df = pd.DataFrame(info)
df

             Name        ID  Cgpa
0    Anik Chandra  18101070  3.67
1  Abdul Rab Anik  18101073  3.48
2    Anisul islam  18101079  3.46

In [7]:
# 4th way of creating a dataframe
info1 = {
    ('Anik Chandra',70,"CSE"),
    ('Abdul Rab Anik',73,"CSE"),
    ('Anisul islam',79,"CSE")
}
df = pd.DataFrame(info1, columns=["Name","ID","Dept"])
df

             Name  ID Dept
0    Anik Chandra  70  CSE
1  Abdul Rab Anik  73  CSE
2    Anisul islam  79  CSE

In [11]:
# 5th way of creating a dataframe
info2 = [
    {'Name':"Anik Chandra","ID":70,"Dept":"CSE"},
    {'Name':"Abdul Rab Anik","ID":73,"Dept":"CSE"},
    {'Name':"Anisul islam","ID":79,"Dept":"CSE"},
]
df = pd.DataFrame(info2)
df

             Name  ID Dept
0    Anik Chandra  70  CSE
1  Abdul Rab Anik  73  CSE
2    Anisul islam  79  CSE